ХамелионЦРПТ/src/Documents/СписаниеКМНанесенныхНеНанесенныхНаТовар_ХамелеонЦРПТ/СписаниеКМНанесенныхНеНанесенныхНаТовар_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеКМНанесенныхНеНанесенныхНаТовар_ХамелеонЦРПТ</name>
  <basedOn>Document.ВводВОборот_ХамелеонЦРПТ</basedOn>
  <basedOn>Document.ЗаказМарок_ХамелеонЦРПТ</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиКМЭмитированые_ХамелеонЦРПТ</registerRecords>
  <registerRecords>AccumulationRegister.Резервы_ХамелеонЦРПТ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументов_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>_Order_ID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОтправки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаСписания</name>
    <type>
      <types>EnumRef.ПричинаСписания_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНомеровКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСписанияСУЗ</name>
    <type>
      <types>EnumRef.ПричинаСписанияСУЗ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукции</name>
    <type>
      <types>EnumRef.ТипПродукции_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСписания</name>
    <type>
      <types>EnumRef.ВидДокументаСписания_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧерезСУЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>CatalogRef.КодТНВЭД_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНомеровКМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКороба</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПаллет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>cis</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаСписанияКМ</name>
      <type>
        <types>EnumRef.ПричинаСписания_ХамелеонЦРПТ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ХамелионЦРПТ/src/AccumulationRegisters/ОстаткиКМ_в_Обороте_ХамелеонЦРПТ/ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиКМ_в_Обороте_ХамелеонЦРПТ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ID_Строки</name>
    <type>
      <types>CatalogRef.ID_строки_партия_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ХамелионЦРПТ/src/AccumulationRegisters/Резервы_ХамелеонЦРПТ/Резервы_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Резервы_ХамелеонЦРПТ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ХамелионЦРПТ/src/AccumulationRegisters/ОстаткиКМЭмитированые_ХамелеонЦРПТ/ОстаткиКМЭмитированые_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиКМЭмитированые_ХамелеонЦРПТ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ID_Строки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КМОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ХамелионЦРПТ/src/InformationRegisters/НомераКМ_ХамелеонЦРПТ/НомераКМ_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераКМ_ХамелеонЦРПТ</name>
  <resources>
    <name>OrderID</name>
    <type>
      <types>CatalogRef.ID_строки_партия_ХамелеонЦРПТ</types>
    </type>
  </resources>
  <resources>
    <name>НомерКМ_Короткий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КМНапечатан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>НомерКМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументЗаказа</name>
    <type>
      <types>DocumentRef.ЗаказМарок_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСтроки_1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/Enums/СтатусыДокументов_ХамелеонЦРПТ/СтатусыДокументов_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументов_ХамелеонЦРПТ</name>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОтвета</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>ФайлОбработанЧастично</name>
  </enumValues>
  <enumValues>
    <name>ОтправленЧерновик</name>
  </enumValues>
  <enumValues>
    <name>ЧерновикОбработан</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннийПромежуточныйСтатус</name>
  </enumValues>
  <enumValues>
    <name>ПринятИПереданВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>КМЧастичноЭмитированы</name>
  </enumValues>
  <enumValues>
    <name>КМЭмитирован</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОтветаОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессе</name>
  </enumValues>
  <enumValues>
    <name>ОжидаемРегистрациюУчастникавИСМП</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноПринят</name>
  </enumValues>
  <enumValues>
    <name>ОтправленВЭДО</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Enums/ВидДокументаСписания_ХамелеонЦРПТ/ВидДокументаСписания_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДокументаСписания_ХамелеонЦРПТ</name>
  <enumValues>
    <name>КМНеНанесенныйНаТовар</name>
  </enumValues>
  <enumValues>
    <name>СИсКМНанесенныйНаТоварБезВыводаИзОборота</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Enums/ТипПродукции_ХамелеонЦРПТ/ТипПродукции_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипПродукции_ХамелеонЦРПТ</name>
  <enumValues>
    <name>Обувь</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>Молоко</name>
  </enumValues>
  <enumValues>
    <name>Фото</name>
  </enumValues>
  <enumValues>
    <name>Свет</name>
  </enumValues>
  <enumValues>
    <name>Табак</name>
  </enumValues>
  <enumValues>
    <name>Фармацевтика</name>
  </enumValues>
  <enumValues>
    <name>Парфюм</name>
  </enumValues>
  <enumValues>
    <name>Одежда</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>ПитьеваяВода</name>
  </enumValues>
  <enumValues>
    <name>Белье</name>
  </enumValues>
  <enumValues>
    <name>Рамы</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>Пиво</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Documents/СписаниеКМНанесенныхНеНанесенныхНаТовар_ХамелеонЦРПТ/ObjectModule.bsl
Функция дополнитьСтроку(Ср)
	ВОзврат Обработки._Запуск_ХамелеонЦРПТ.ДополнитьСтроку_11(Ср,14,"0");
	
Конецфункции


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.
	Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Записывать=Истина;
	Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Очистить();
	
	Движения.Резервы_ХамелеонЦРПТ.Записывать=Истина;
	Движения.Резервы_ХамелеонЦРПТ.Очистить();
	СуммаДОкумента=0;
	Для Каждого Стр Из Товары Цикл
		СуммаДокумента=СуммаДокумента+Стр.КоличествоКМ*Стр.Цена;
	КонецциклА;
	Если ЭтоТОбъект.Статус=перечисления.СтатусыДокументов_ХамелеонЦРПТ.Обработан Тогда
		
		Для Каждого Стр Из ЭтотОбъект.СерийныеНомера Цикл
			
			Если ПричинаСписания=Перечисления.ВидДокументаСписания_ХамелеонЦРПТ.КМНеНанесенныйНаТовар Тогда
				Добав=Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Добавить();
			Иначе
				Добав=Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Добавить();
			КонецЕсли;
			//Добав.ID_Строки=Стр.ID_строки_партии;
			Добав.ВидДвижения=ВидДвиженияНакопления.Расход;
			Добав.Количество=1;
			Добав.Организация=ЭтотОбъект.Организация;
			Добав.Период=Дата;
			Добав.Продукция=Стр.НаименованиеТовара;
			Добав.СерийныйНомер=Стр.cis;
			
		КонецЦикла;
	ИначеЕсли Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.ОжидаетОтветаОтКлиента
		ИЛИ Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.ПодготовленКОтправке Тогда
		Для Каждого Стр Из ЭтотОбъект.СерийныеНомера Цикл
			Добав=Движения.Резервы_ХамелеонЦРПТ.Добавить();
			//Добав.ID_Строки=Стр.ID_строки_партии;
			Добав.ВидДвижения=ВидДвиженияНакопления.Приход;
			Добав.Количество=1;
			Добав.Организация=ЭтотОбъект.Организация;
			Добав.Период=Дата;
			Добав.СерийныйНомер=Стр.cis;
			
		КонецЦикла;
		
	Конецесли;	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ДатаПроизводства=ТекущаяДата();
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено Тогда
		
		Если ТипДанныхЗаполнения <> Тип("Структура")
			И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
			ДокументОснование = ДанныеЗаполнения;
		ИначеЕсли ТипДанныхЗаполнения = Тип("Структура")
			И ДанныеЗаполнения.Свойство("Основание")
			И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Основание.Метаданные()) Тогда
			ДокументОснование = ДанныеЗаполнения.Основание;
		КонецЕсли;

		Если ДокументОснование <> Неопределено Тогда
			
			Если типЗнч(ДокументОснование)=Тип("ДокументСсылка.ВводВОборот_ХамелеонЦРПТ") тогда
				ДокОснование=Документоснование;
				ЗаполнитьЗначенияСвойств(ЭтотОБъект,ДокОснование,,"Номер,Дата,_Order_ID");
				Для Каждого Стр_1 Из ДокОснование.Товары Цикл
					Добав=Товары.Добавить();
					ЗаполнитьЗначенияСвойств(Добав,Стр_1);
					
				КонецЦикла;
				
				Для Каждого Стр_1 Из ДокОснование.СерийныеНомера Цикл
					Добав=СерийныеНомера.Добавить();
					ЗаполнитьЗначенияСвойств(Добав,Стр_1);	
					Если Не ЗначениеЗаполнено(Добав.cis) Тогда
						Тов=ДокОснование.Товары.Найти(Стр_1.НомерСтрокиСвязи,"НомерСтрокиСвязи");
						Добав.cis="01"+Стр_1.GTIN+"21"+Стр_1.СерийныйНомер+"240"+xmlString(Сред(Тов.КодТНВЭД.Код,1,4));
					КонецЕсли;
				Конеццикла;
			Иначе
				ДокОснование=Документоснование;
				ЗаполнитьЗначенияСвойств(ЭтотОБъект,ДокОснование,,"Номер,Дата,_Order_ID");
				
					//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	НомераКМ_ХамелеонЦРПТ.НомерКМ_Короткий
					|ИЗ
					|	РегистрСведений.НомераКМ_ХамелеонЦРПТ КАК НомераКМ_ХамелеонЦРПТ
					|ГДЕ
					|	НомераКМ_ХамелеонЦРПТ.ДокументЗаказа = &ДокументЗаказа";
				
				Запрос.УстановитьПараметр("ДокументЗаказа", ДокОснование);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Если ВыборкаДетальныеЗаписи.Количество()>0 тогда
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
				Штрихкод=ВыборкаДетальныеЗаписи.НомерКМ_Короткий;		
				
				ЗаписатьШтрихКодВДокумент(Штрихкод);
					КонецЦикла;
				Иначе
					
					Для Каждого Стр_1 Из Документоснование.КМИзAPI Цикл
						
				Штрихкод=Стр_1.НомерКМ_Короткий;		
				
				ЗаписатьШтрихКодВДокумент(Штрихкод);
				Конеццикла;		
			КонецЕсли;
			  КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ЗаписатьШтрихКодВДокумент(Штрихкод)
	КоличествоСтрокБыло=СерийныеНомера.Количество();
	
	Если СтрДлина(Штрихкод)=20 Тогда
		Штрихкод=Сред(Штрихкод,3);
	КонецЕсли;
	
Если ТекущийПользователь.СайтыВходаВСистему.Наименование<>"Табак"
		И ТекущийПользователь.СайтыВходаВСистему.Наименование<>"Альтернативный табак" ТОгда 
	ШтрихКод_1=(ШтрихКод);
	
	//ШтрихКод_1=КодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
	//штрихКод=СтрЗаменить(ШтрихКод_1,"%1D","");
	ШтрихКод=Сред(ШтрихКод,1,38);
	//штрихКод_1=РаскодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
				Если ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда
								ШтрихКод=Сред(ШтрихКод,1,38);

				ИначеЕсли Сред(штрихКод_1,32,3)<>"240" Тогда
								ШтрихКод=Сред(ШтрихКод,1,31);
								//ШтрихКод=Сред(штрихКод_1,1,Найти(штрихКод_1,"%1D")-1);
								//ШтрихКод=РаскодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
							Иначе
								
								           ШтрихКод=штрихКод_1;
							
							КонецЕсли;
							
							
							Если ТекущийПользователь.СайтыВходаВСистему.Наименование="Фармацевтика" Тогда
													Если Сред(ШтрихКод,1,2)="01" Тогда
														ШтрихКод=Сред(ШтрихКод,3,14)+Сред(ШтрихКод,19);
													КонецЕсли;
																			
																		КОнецЕсли;
															КонецЕсли;
																		
												Если СтрДлина(ШтрихКод)>50 Тогда
													ШтрихКод=Сред(ШтрихКод,1,35);
												КонецЕсли;
												ШтрихКод_1=(ШтрихКод);
												
												//ШтрихКод_1=КодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
												//штрихКод=СтрЗаменить(ШтрихКод_1,"%1D","");
												ШтрихКод=Сред(ШтрихКод,1,38);
												//штрихКод_1=РаскодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
												
												Если ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда

																			ШтрихКод=Сред(ШтрихКод,1,38);
													ИначеЕсли Сред(штрихКод_1,32,3)<>"240" Тогда
																			ШтрихКод=Сред(ШтрихКод,1,31);
																			//ШтрихКод=Сред(штрихКод_1,1,Найти(штрихКод_1,"%1D")-1);
																			//ШтрихКод=РаскодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
																		Иначе
																			
																			           ШтрихКод=штрихКод_1;
																		
																		КонецЕсли;

																		
												//Если Стр_1=Неопределено Тогда
													Если СерийныеНомера.НайтиСтроки(Новый Структура("cis",ШтрихКод)).Количество()>0 Тогда
														Сообщить("CiS "+ШтрихКод+" уже присутствует в документе");
														Возврат;
													КонецЕсли;
												//КонецЕсли;	
												
												
												
												Запрос = Новый Запрос;
												Запрос.Текст = 
													"ВЫБРАТЬ
													|	ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки.Продукция
													|ИЗ
													|	РегистрНакопления.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Остатки(
													|			,
													|			Организация = &Организация
													|				И СерийныйНомер = &СерийныйНомер) КАК ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки";
												
												Запрос.УстановитьПараметр("Организация", Организация);
												Запрос.УстановитьПараметр("СерийныйНомер", ШтрихКод);
												
												РезультатЗапроса = Запрос.Выполнить();
												
												ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
												
												Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
													// Вставить обработку выборки ВыборкаДетальныеЗаписи
													
													Продукция=ВыборкаДетальныеЗаписи.Продукция;
														Добав=СерийныеНомера.Добавить();
													Добав.GTIN=ДополнитьСтроку(xmlString(Продукция.GTIN));
													Добав.НаименованиеТовара=Продукция;
													Добав.cis=ШтрихКод;
													
													
													ППП=Товары.НайтиСтроки(Новый структура("gtin",Продукция));
													Если ППП.Количество()=0 Тогда
														Добав_1=Товары.Добавить();
														Добав_1.GTIN=Продукция;
														Добав_1.КодТНВЭД=Продукция.КодТНВЭД;
														
														
														//Добав_1.СпособВыпускаТоваров="";
														Добав_1.НомерСтрокиСвязи=Добав_1.НомерСтроки;
														Добав_1.КоличествоКМ=1;
													Иначе
														Добав_1=ППП[0];
														Добав_1.КоличествоКМ=Добав_1.КоличествоКМ+1;
														
													КонецЕсли;
													Добав.НомерСтрокиСвязи=Добав_1.НомерСтрокиСвязи;
													
												КонецЦикла;
												
													Если КоличествоСтрокБыло=СерийныеНомера.Количество() Тогда
														Если РегистрыСведений.НастройкиПрограммы_ХамелеонЦРПТ.Получить().ПриЗаполненииОтгрузкиНеУчитыватьОстаток Тогда
															Продукция=Справочники.Продукция_ХамелеонЦРПТ.ПустаяСсылка();
															Добав=СерийныеНомера.Добавить();
															Добав.GTIN=ДополнитьСтроку(xmlString(Продукция.GTIN));
															//Добав.НаименованиеТовара=Продукция;
															Добав.cis=ШтрихКод;
															
															
																Добав_1=Товары.Добавить();
												//				Добав_1.ЕдиницаИзмерения=ТекущийПользователь.ОсновнаяЕдиницаИзмерения;
																
													//			Добав_1.СпособВыпускаТоваров="";
																Добав_1.НомерСтрокиСвязи=Добав_1.НомерСтроки;
															Добав_1.КоличествоКМ=Добав_1.КоличествоКМ+1;
															Добав.НомерСтрокиСвязи=Добав_1.НомерСтрокиСвязи;
															
														
															

														Иначе
															Сообщить("КМ "+Строка(Штрихкод)+" не добавлена");
														КонецЕсли
													Конецесли;
						
						
						
			//		конеццикла
			//	КонецЕсли;
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

				
				//Для Каждого Стр_1 Из ДокОснование.Товары Цикл
				//	Добав=Товары.Добавить();
				//	ЗаполнитьЗначенияСвойств(Добав,Стр_1);
				//	
				//КонецЦикла;
				//
				//Для Каждого Стр_1 Из ДокОснование.СерийныеНомера Цикл
				//	Добав=СерийныеНомера.Добавить();
				//	ЗаполнитьЗначенияСвойств(Добав,Стр_1);	
				//	Если Не ЗначениеЗаполнено(Добав.cis) Тогда
				//		Тов=ДокОснование.Товары.Найти(Стр_1.НомерСтрокиСвязи,"НомерСтрокиСвязи");
				//		Добав.cis="01"+Стр_1.GTIN+"21"+Стр_1.СерийныйНомер+"240"+xmlString(Сред(Тов.КодТНВЭД.Код,1,4));
				//	КонецЕсли;
				//Конеццикла;
				
				
КонецПроцедуры
Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
	ЭтотОБъект._Order_ID="";
	ЭтоТОбъект.Статус="";
	ЭтотОбъект.ОшибкаОтправки="";
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		ЭтотОБъект.КоличествоКМ=Товары.Итог("КоличествоКМ");
	ЭтотОбъект.КоличествоНомеровКМ=Товары.Итог("КоличествоНомеровКМ");

КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вставить содержимое обработчика.
		Если //ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Шины 
			ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Молоко
			//ИЛИ ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Парфюм
			//ИЛИ ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Свет
			//ИЛИ ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Одежда
			
			ИЛИ ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Табак
			ИЛИ ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.АльтернативныйТабак
			
			ИЛИ ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Фармацевтика
			//ИЛИ ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Фото
			Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПричинаСписания"));
		Иначе
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ТипСписанияСУЗ"));
			
	КонецЕсли;
КонецПроцедуры
